consolidate v2 ops into just ops
